reports/lab3/k6-c50.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 50 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 50/50 VUs, 32 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  0m01.0s/1m0s

running (0m02.0s), 50/50 VUs, 82 complete and 0 interrupted iterations
default   [   3% ] 50 VUs  0m02.0s/1m0s

running (0m03.0s), 50/50 VUs, 133 complete and 0 interrupted iterations
default   [   5% ] 50 VUs  0m03.0s/1m0s

running (0m04.0s), 50/50 VUs, 188 complete and 0 interrupted iterations
default   [   7% ] 50 VUs  0m04.0s/1m0s

running (0m05.9s), 50/50 VUs, 245 complete and 0 interrupted iterations
default   [   8% ] 50 VUs  0m05.0s/1m0s

running (0m06.9s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  10% ] 50 VUs  0m06.0s/1m0s

running (0m07.9s), 50/50 VUs, 350 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  0m07.0s/1m0s

running (0m08.9s), 50/50 VUs, 409 complete and 0 interrupted iterations
default   [  13% ] 50 VUs  0m08.0s/1m0s

running (0m09.9s), 50/50 VUs, 472 complete and 0 interrupted iterations
default   [  15% ] 50 VUs  0m09.0s/1m0s

running (0m10.9s), 50/50 VUs, 558 complete and 0 interrupted iterations
default   [  17% ] 50 VUs  0m10.0s/1m0s

running (0m11.9s), 50/50 VUs, 634 complete and 0 interrupted iterations
default   [  18% ] 50 VUs  0m11.0s/1m0s

running (0m12.9s), 50/50 VUs, 723 complete and 0 interrupted iterations
default   [  20% ] 50 VUs  0m12.0s/1m0s

running (0m13.9s), 50/50 VUs, 814 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  0m13.0s/1m0s

running (0m14.9s), 50/50 VUs, 907 complete and 0 interrupted iterations
default   [  23% ] 50 VUs  0m14.0s/1m0s

running (0m15.9s), 50/50 VUs, 997 complete and 0 interrupted iterations
default   [  25% ] 50 VUs  0m15.0s/1m0s

running (0m16.9s), 50/50 VUs, 1096 complete and 0 interrupted iterations
default   [  27% ] 50 VUs  0m16.0s/1m0s

running (0m17.9s), 50/50 VUs, 1170 complete and 0 interrupted iterations
default   [  28% ] 50 VUs  0m17.0s/1m0s

running (0m18.9s), 50/50 VUs, 1259 complete and 0 interrupted iterations
default   [  30% ] 50 VUs  0m18.0s/1m0s

running (0m19.9s), 50/50 VUs, 1346 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  0m19.0s/1m0s

running (0m20.9s), 50/50 VUs, 1427 complete and 0 interrupted iterations
default   [  33% ] 50 VUs  0m20.0s/1m0s

running (0m21.9s), 50/50 VUs, 1515 complete and 0 interrupted iterations
default   [  35% ] 50 VUs  0m21.0s/1m0s

running (0m22.9s), 50/50 VUs, 1608 complete and 0 interrupted iterations
default   [  37% ] 50 VUs  0m22.0s/1m0s

running (0m23.9s), 50/50 VUs, 1705 complete and 0 interrupted iterations
default   [  38% ] 50 VUs  0m23.0s/1m0s

running (0m24.9s), 50/50 VUs, 1792 complete and 0 interrupted iterations
default   [  40% ] 50 VUs  0m24.0s/1m0s

running (0m25.9s), 50/50 VUs, 1880 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  0m25.0s/1m0s

running (0m26.9s), 50/50 VUs, 1965 complete and 0 interrupted iterations
default   [  43% ] 50 VUs  0m26.0s/1m0s

running (0m27.9s), 50/50 VUs, 2055 complete and 0 interrupted iterations
default   [  45% ] 50 VUs  0m27.0s/1m0s

running (0m28.9s), 50/50 VUs, 2149 complete and 0 interrupted iterations
default   [  47% ] 50 VUs  0m28.0s/1m0s

running (0m29.9s), 50/50 VUs, 2243 complete and 0 interrupted iterations
default   [  48% ] 50 VUs  0m29.0s/1m0s

running (0m30.9s), 50/50 VUs, 2338 complete and 0 interrupted iterations
default   [  50% ] 50 VUs  0m30.0s/1m0s

running (0m31.9s), 50/50 VUs, 2407 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  0m31.0s/1m0s

running (0m32.9s), 50/50 VUs, 2493 complete and 0 interrupted iterations
default   [  53% ] 50 VUs  0m32.0s/1m0s

running (0m33.9s), 50/50 VUs, 2582 complete and 0 interrupted iterations
default   [  55% ] 50 VUs  0m33.0s/1m0s

running (0m34.9s), 50/50 VUs, 2667 complete and 0 interrupted iterations
default   [  57% ] 50 VUs  0m34.0s/1m0s

running (0m36.7s), 50/50 VUs, 2756 complete and 0 interrupted iterations
default   [  58% ] 50 VUs  0m35.0s/1m0s

running (0m37.7s), 50/50 VUs, 2854 complete and 0 interrupted iterations
default   [  60% ] 50 VUs  0m36.0s/1m0s

running (0m38.7s), 50/50 VUs, 2953 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  0m37.0s/1m0s

running (0m39.7s), 50/50 VUs, 3037 complete and 0 interrupted iterations
default   [  63% ] 50 VUs  0m38.0s/1m0s

running (0m40.7s), 50/50 VUs, 3125 complete and 0 interrupted iterations
default   [  65% ] 50 VUs  0m39.0s/1m0s

running (0m41.7s), 50/50 VUs, 3217 complete and 0 interrupted iterations
default   [  67% ] 50 VUs  0m40.0s/1m0s

running (0m42.7s), 50/50 VUs, 3303 complete and 0 interrupted iterations
default   [  68% ] 50 VUs  0m41.0s/1m0s

running (0m43.7s), 50/50 VUs, 3400 complete and 0 interrupted iterations
default   [  70% ] 50 VUs  0m42.0s/1m0s

running (0m44.7s), 50/50 VUs, 3487 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  0m43.0s/1m0s

running (0m45.7s), 50/50 VUs, 3580 complete and 0 interrupted iterations
default   [  73% ] 50 VUs  0m44.0s/1m0s

running (0m46.7s), 50/50 VUs, 3666 complete and 0 interrupted iterations
default   [  75% ] 50 VUs  0m45.0s/1m0s

running (0m47.7s), 50/50 VUs, 3754 complete and 0 interrupted iterations
default   [  77% ] 50 VUs  0m46.0s/1m0s

running (0m48.7s), 50/50 VUs, 3837 complete and 0 interrupted iterations
default   [  78% ] 50 VUs  0m47.0s/1m0s

running (0m49.7s), 50/50 VUs, 3916 complete and 0 interrupted iterations
default   [  80% ] 50 VUs  0m48.0s/1m0s

running (0m50.7s), 50/50 VUs, 3995 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  0m49.0s/1m0s

running (0m51.7s), 50/50 VUs, 4073 complete and 0 interrupted iterations
default   [  83% ] 50 VUs  0m50.0s/1m0s

running (0m52.7s), 50/50 VUs, 4153 complete and 0 interrupted iterations
default   [  85% ] 50 VUs  0m51.0s/1m0s

running (0m53.7s), 50/50 VUs, 4233 complete and 0 interrupted iterations
default   [  87% ] 50 VUs  0m52.0s/1m0s

running (0m54.7s), 50/50 VUs, 4312 complete and 0 interrupted iterations
default   [  88% ] 50 VUs  0m53.0s/1m0s

running (0m55.7s), 50/50 VUs, 4389 complete and 0 interrupted iterations
default   [  90% ] 50 VUs  0m54.0s/1m0s

running (0m56.7s), 50/50 VUs, 4466 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  0m55.0s/1m0s

running (0m57.7s), 50/50 VUs, 4544 complete and 0 interrupted iterations
default   [  93% ] 50 VUs  0m56.0s/1m0s

running (0m58.7s), 50/50 VUs, 4623 complete and 0 interrupted iterations
default   [  95% ] 50 VUs  0m57.0s/1m0s

running (0m59.7s), 50/50 VUs, 4701 complete and 0 interrupted iterations
default   [  97% ] 50 VUs  0m58.0s/1m0s

running (1m00.7s), 50/50 VUs, 4781 complete and 0 interrupted iterations
default   [  98% ] 50 VUs  0m59.0s/1m0s

running (1m01.7s), 50/50 VUs, 4855 complete and 0 interrupted iterations
default   [ 100% ] 50 VUs  1m00.0s/1m0s

running (1m02.7s), 02/50 VUs, 4906 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  1m0s


  █ THRESHOLDS 

    predict_failures
    ✓ 'rate<0.01' rate=0.00%

    predict_latency_ms
    ✗ 'p(95)<250' p(95)=1563.171687


  █ TOTAL RESULTS 

    checks_total.......: 14724   234.395812/s
    checks_succeeded...: 100.00% 14724 out of 14724
    checks_failed......: 0.00%   0 out of 14724

    ✓ status is 200
    ✓ probability present
    ✓ version reported

    CUSTOM
    predict_failures...............: 0.00%  0 out of 4908
    predict_latency_ms.............: avg=632.806687 min=66.414563 med=504.002485 p(95)=1563.171687 p(99)=2648.158842 max=3664.526155

    HTTP
    http_req_duration..............: avg=632.8ms    min=66.41ms   med=504ms      p(95)=1.56s       p(99)=2.64s       max=3.66s      
      { expected_response:true }...: avg=632.8ms    min=66.41ms   med=504ms      p(95)=1.56s       p(99)=2.64s       max=3.66s      
    http_req_failed................: 0.00%  0 out of 4908
    http_reqs......................: 4908   78.131937/s

    EXECUTION
    iteration_duration.............: avg=616.14ms   min=66.64ms   med=490.25ms   p(95)=1.52s       p(99)=2.3s        max=3.37s      
    iterations.....................: 4908   78.131937/s
    vus............................: 2      min=2         max=50
    vus_max........................: 50     min=50        max=50

    NETWORK
    data_received..................: 1.6 MB 26 kB/s
    data_sent......................: 1.2 MB 20 kB/s



running (1m02.8s), 00/50 VUs, 4908 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  1m0s